// 왜 1초 이후에 가격이 떨어지는것도 1이고 1초 이후에 가격이 오르는 것도 1이냐 -> 바로 떨어져도 그 직전까지 돈을 유지한 것으로 취급해서 최소 유지 기간은 1
// 그럼 맨 마지막은 0 고정이고 뒤에서부터 순회
// -2 위치도 1로 고정(-1이 더 커서 +1을 해도 1이고 작아도 1임)
// 이후에 뒤에가 더 크면 +1, 아니면 1로 set
// 흠 근데 거꾸로 순회하면서 return에 넣을 배열 만드는건 앞에 추가해야하는데 이러면 추가할 때마다 N이니까 N^2 될 것 같은데.. 일단 구현해보기
// =>
// function solution(prices) {
//     const stack = [1, 0];
//     let cnt = 1;
//     for (let i = prices.length - 3; i >= 0; i--) {
//         if (prices[i] < prices[i + 1]) cnt += 1;
//         else cnt = 1;
//         console.log(prices[i], cnt);
//         stack.unshift(cnt);
//     }
//     return stack;
// }
// 값을 전역으로 유지하면 올랐다 내려가는 상황을 대응할 수 없네

// N번씩 순회하면서 새로운 배열에 +1씩 해주는 방식으로 하면 N^2으로는 가능할 것 같은데 배열 크기가 10만이라 안 될 것 같음
// 방법 모르겠으니까 책 한 번 볼게요 오래 고민했음
